src/toir_cf/src/DataProcessors/торо_ПодборОбъектовРемонтныхРабот/торо_ПодборОбъектовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ПодборОбъектовРемонтныхРабот</name>
</mdclass:DataProcessor>

src/toir_cf/src/InformationRegisters/торо_НормативныеРемонтыОборудования/торо_НормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудования</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РассчитыватьНаработкуВПростое</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСтратегии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьДатыЗамещающихРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_НормативныеРемонтыОборудованияУдаленные/торо_НормативныеРемонтыОборудованияУдаленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудованияУдаленные</name>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_РемонтныеЦиклыОборудования/торо_РемонтныеЦиклыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РемонтныеЦиклыОборудования</name>
  <resources>
    <name>НеУчитыватьПростоиОборудования</name>
    <comment>Использовать плановую наработка во время простоя (т.е. планировать ТО по наработке во время простоя)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидЦепочки</name>
    <type>
      <types>CatalogRef.торо_ЦепочкиРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаОбъектовРемонтов</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_РегламентныеМероприятияИСпискиОбъектов/торо_РегламентныеМероприятияИСпискиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РегламентныеМероприятияИСпискиОбъектов</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать период между ремонтами в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/DataProcessors/торо_ПодборОбъектовРемонтныхРабот/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СоответствиеОбъектовРемонтаВидамРемонтаИЦепочкам(ОбъектыРемонта, Параметры) Экспорт
	
	ИспользоватьПланированиеПоЖесткимРемЦиклам = ПолучитьФункциональнуюОпцию("торо_ИспользоватьПланированиеПоЖесткимРемЦиклам");
	
	ТолькоВидыРемонтовППР = Параметры.ТолькоВидыРемонтовППР;
	ПодбиратьЦепочкиРемонтов = ИспользоватьПланированиеПоЖесткимРемЦиклам И Параметры.ПодбиратьЦепочкиРемонтов;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НормативныеРемонтыОборудования.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ ВТ_НормативныеРемонты
	|ИЗ
	|	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудованияУдаленные КАК торо_НормативныеРемонтыОборудованияУдаленные
	|		ПО торо_НормативныеРемонтыОборудования.ОбъектРемонта = торо_НормативныеРемонтыОборудованияУдаленные.ОбъектРемонта
	|			И торо_НормативныеРемонтыОборудования.ВидРемонта = торо_НормативныеРемонтыОборудованияУдаленные.ВидРемонта
	|			И торо_НормативныеРемонтыОборудования.ТиповойОР = торо_НормативныеРемонтыОборудованияУдаленные.ТиповойОР
	|ГДЕ
	|	&УсловныйОтбор
	|	И торо_НормативныеРемонтыОборудованияУдаленные.ОбъектРемонта ЕСТЬ NULL
	|	И торо_НормативныеРемонтыОборудования.ОбъектРемонта В(&ОбъектыРемонта)
	|	И торо_НормативныеРемонтыОборудования.Приоритет
	|	И НЕ торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании";

	Если ПодбиратьЦепочкиРемонтов Тогда
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
		|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР
		|ПОМЕСТИТЬ ВТ_ОбъектыРемонта
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&ОбъектыРемонта)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов КАК ОбъектРемонта,
		|	торо_РемонтныеЦиклыОборудования.ВидЦепочки КАК ВидРемонта
		|ИЗ
		|	РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбъектыРемонта КАК ВТ_ОбъектыРемонта
		|		ПО торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов = ВТ_ОбъектыРемонта.Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ОбъектыРемонта.Ссылка,
		|	торо_РемонтныеЦиклыОборудования.ВидЦепочки
		|ИЗ
		|	РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбъектыРемонта КАК ВТ_ОбъектыРемонта
		|		ПО торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов = ВТ_ОбъектыРемонта.ТиповойОР
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_НормативныеРемонты.ОбъектРемонта,
		|	ВТ_НормативныеРемонты.ВидРемонта
		|ИЗ
		|	ВТ_НормативныеРемонты КАК ВТ_НормативныеРемонты
		|ИТОГИ ПО
		|	ОбъектРемонта";
			
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	ВТ_НормативныеРемонты.ОбъектРемонта,
		|	ВТ_НормативныеРемонты.ВидРемонта
		|ИЗ
		|	ВТ_НормативныеРемонты КАК ВТ_НормативныеРемонты
		|ИТОГИ ПО
		|	ОбъектРемонта";	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Если ТолькоВидыРемонтовППР  Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловныйОтбор", "торо_НормативныеРемонтыОборудования.ВидРемонта.ПланГрафикППР");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловныйОтбор", "ИСТИНА");
	КонецЕсли;

	Запрос.УстановитьПараметр("ОбъектыРемонта", ОбъектыРемонта);
	
	СоответствиеОбъектовРемонта = Новый Соответствие; // Ключ - объект ремонта, Значение - Виды ремонта.
	
	ВыборкаОбъектРемонта = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъектРемонта.Следующий() Цикл
		
		ВидыРемонта = Новый Массив;	
		
		Выборка = ВыборкаОбъектРемонта.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ВидыРемонта.Добавить(Выборка.ВидРемонта);
		КонецЦикла;
		
		СоответствиеОбъектовРемонта.Вставить(ВыборкаОбъектРемонта.ОбъектРемонта, ВидыРемонта);
	КонецЦикла;
	
	Возврат СоответствиеОбъектовРемонта;
	
КонецФункции	

Функция СоответствиеСписковОбъектовРМВидамМероприятий(СпискиОбъектов, Параметры) Экспорт
	
	ТолькоГрафикиМероприятий = Параметры.ТолькоГрафикиМероприятий;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов КАК СписокОбъектов,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.ВидМероприятия КАК ВидМероприятия,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.ВидМероприятия.ГрафикМероприятий КАК ВидМероприятияГрафикМероприятий
		|ИЗ
		|	РегистрСведений.торо_РегламентныеМероприятияИСпискиОбъектов КАК торо_РегламентныеМероприятияИСпискиОбъектов
		|ГДЕ
		|	&УсловныйОтбор
		|	И торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов В(&СпискиОбъектов)
		|	И торо_РегламентныеМероприятияИСпискиОбъектов.НеУчитыватьПродолжительность = ЛОЖЬ
		|ИТОГИ ПО
		|	СписокОбъектов";
	
	Запрос.УстановитьПараметр("СпискиОбъектов", СпискиОбъектов);
	
	Если ТолькоГрафикиМероприятий  Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловныйОтбор", "торо_РегламентныеМероприятияИСпискиОбъектов.ВидМероприятия.ГрафикМероприятий");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловныйОтбор", "ИСТИНА");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответствиеСписковОбъектов = Новый Соответствие; // Ключ - список объектов РМ, Значение - Виды мероприятий.
	
	ВыборкаСписокОбъектов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСписокОбъектов.Следующий() Цикл
		
		ВидыМероприятий = Новый Массив;	
		
		Выборка = ВыборкаСписокОбъектов.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ВидыМероприятий.Добавить(Выборка.ВидМероприятия);
		КонецЦикла;
		
		СоответствиеСписковОбъектов.Вставить(ВыборкаСписокОбъектов.СписокОбъектов, ВидыМероприятий);		
	КонецЦикла;
	
	Возврат СоответствиеСписковОбъектов;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
